app/controllers/home_controller.rb

SELECT "products".* FROM "products"
---
  def index

    # list all of the products!
    @products = Product.all

INSERT INTO "products" ("name", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["quantity", 1], ["created_at", "2015-08-12 17:36:59.927411"], ["updated_at", "2015-08-12 17:36:59.927411"]]
---
  def create

    puts '-----PARAMS-----'
    puts params
    puts '----------'
    @product = Product.create(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 0]]
---
  def delete
    @product = Product.find(params[:product][:id]).destroy