app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "isaacmabueno@gmail.com"]]
---
  def create
    #this is going to be the POST request to validate/create a session
    @user = User.find_by_email(params[:email])